<template>
  <div>
    <div>这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容</div>
    <div>这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容</div>
    <div>这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容</div>
    <div>这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容</div>
    <div>这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容</div>
    <div>这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容</div>
    <div>这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容</div>
    <div>这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容</div>
    <div>这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容</div>
    <div>这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容</div>
    <div>这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容</div>
    <div>这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容</div>
    <div>这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容</div>
    <div>这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容</div>
    <div>这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容</div>
    <div>这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容</div>
    <div>这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容</div>
    <div>这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容</div>
    <div>这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容</div>
    <div>这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容</div>
    <div>这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容</div>
    <div>这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容</div>
    <div>这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容</div>
    <div>这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容</div>
    <div>这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容</div>
    <div>这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容</div>
    <div>这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容</div>
    <div>这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容</div>
    <div>这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容</div>
    <div>这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容</div>
    <div>这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容</div>
    <div>这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容</div>
    <div>这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容</div>
    <div>这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容</div>
    <div>这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容</div>
    <div>这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容这是测试内容</div>
  </div>
</template>

<script type="text/ecmascript-6">
export default {
  name: 'ArticleAbstractList'
}
</script>

<style lang="stylus" type="text/stylus" rel="stylesheet/stylus" scoped>

</style>
